 clc;
clear all
close all;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%主函数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
fig_mark = 1;           %（做蒙特卡洛实验赋值为0）画图标记，1为画空间波束图和阵元位置图  0 为不画图
move_mark = 0;          % 阵元运动标记，1为运动（失败） 0为不运动（成功）

%%    目标信号源
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%要扩展信号源，更改信号源坐标矩阵
%所有目标的z坐标规定为705km左右
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                                                               
Pos_K = [0,100000,-710000];                   %目标位置
K = size(Pos_K,1);                            %信源数
%%    signal
snr = 0;                                                                                %信噪比

f0 = 0.3e9;                                                                                %中心频率
c = 3e8;                                                                                 %光速
lambda = c/f0;                                                                           %信号波长


%%    接收平台
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%要扩展接收阵元，更改坐标矩阵
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% %场景一：非均匀线阵
% P_receive(:,1) = [0,72822,149170,183113,220765,260122,332086,363332,438777,449896,488367,540218,601492,651466,676052,717570,787372,821199,845568,875398]';
% P_receive(:,2) = zeros(20,1);
% P_receive(:,3) = zeros(20,1);

% %场景二：非均匀线阵（10个阵元）
% P_receive(:,1) = [0,72822,149170,220765,363332,449896,651466,717570,821199,875398]';
% P_receive(:,2) = zeros(10,1);
% P_receive(:,3) = zeros(10,1);

% %场景三：非均匀线阵（基线1000km）
% P_receive(:,1) = [0,72822,149170,183113,220765,260122,332086,363332,438777,449896,488367,540218,601492,651466,717570,787372,821199,900925,945568,1000000]';
% P_receive(:,2) = zeros(20,1);
% P_receive(:,3) = zeros(20,1);

% %场景四：三维阵列（15个阵元）
% P_receive(:,1) = [-324110,250905,72056,-154469,307450,365884,3910,235603,-40735,-232689,-131520,-292852,-4586,176721,-34612]';
% P_receive(:,2) = [148155,-33207,-137886,-130768,-132033,24033,-63978,50728,-3092,-137517,76796,-11632,-149607,-276025,351971]';
% P_receive(:,3) = [-130038,173932,163521,323385,64065,-59630,307079,22770,106467,-121374,311881,120665,-57410,175313,-69008]';

Pos_receive = [0,0,0;
    -217960.470183234,112461.341323135,190800;
    266251.616862773,257393.828847149,186000;
    8056.80394207127,154184.804042012,198100;
    -139758.879767502,181531.942716646,184300;
    177871.775003593,86010.0706811836,800;
    -71686.1308675865,-36586.1652857680,700;
    -27039.1781917547,-12688.7534495965,900;
    -173322.287908551,-92850.4668203546,400;
    244483.360882690,115000.513556906,600;
    233917.199512494,110655.729032744,700];           %使用地心直角坐标系

% %场景二：三维阵列（6个阵元）
% P_receive = [0,0,0;
%     -190135.401058293,-101060.669807636,1100;
%     38237.7186644143,114433.799076150,7000;
%     -190447.900437912,161790.415445702,500;
%     114097.548393047,208664.806157196,-500;
%     120889.219061446,290040.762093712,17300];          %使用地心直角坐标系

%%%%%%%%%%%%%%%%%绘制目标和卫星坐标的三维图像
if(0)
figure                          
scatter3(Pos_receive(:,1)/1000,Pos_receive(:,2)/1000,Pos_receive(:,3)/1000+710,50,'filled');
hold on
scatter3(Pos_K(:,1)/1000,Pos_K(:,2)/1000,Pos_K(:,3)/1000+710,80,'red','filled');
hold off
xlabel('X(km)','FontSize',16);
ylabel('Y(km)','FontSize',16);
zlabel('Z(km)','FontSize',16);
% axis([0 10e5 0 1e4 -710e3 0])
else
end
%%    蒙特卡洛实验(要画music谱三维图记得把实验次数改成1，一定要更改music-doa函数的画图标记）
M = size(Pos_receive,1);               %阵元个数
mont = 1;                              %实验次数
X = zeros(K,mont);
Y = zeros(K,mont);
Z = zeros(K,mont);


X_search = (Pos_K(1)-100):0.5:(Pos_K(1)+100);
Y_search = (Pos_K(2)-100):0.5:(Pos_K(2)+100);
Z_search = Pos_K(1,3);                           %定义三个方向扫描范围

error_loca = zeros(mont,length(snr));
mean_loc = zeros(1,length(snr));
%%%%%%%%%%   定位误差（蒙特卡洛实验）
%阵元不运动
if move_mark==0
 for ii = 1:length(snr)  
        for jj = 1:mont
            [X(jj),Y(jj),Z(jj)] = Distributed_music(Pos_K,Pos_receive,X_search,Y_search,lambda,snr(ii),fig_mark);
            error_loca(jj,ii) = (X(jj)-Pos_K(:,1)).^2+(Y(jj)-Pos_K(:,2)).^2;     %定位误差
        end
            mean_loc(ii) = sqrt(sum(error_loca(:,ii))/mont);                                     %平均定位误差
 end
end

%阵元运动
if move_mark==1
 for ii = 1:length(snr)  
        for jj = 1:mont
            [X(jj),Y(jj),Z(jj)] = Distributed_move_music(Pos_K,Pos_receive,X_search,Y_search,lambda,snr(ii),fig_mark);
            error_loca(jj,ii) = (X(jj)-Pos_K(:,1)).^2+(Y(jj)-Pos_K(:,2)).^2;     %定位误差
        end
            mean_loc(ii) = sqrt(sum(error_loca(:,ii))/mont);                                     %平均定位误差
 end
end

%%%%%%蒙特卡洛实验    画空时误差对定位影响图
figure
plot(snr,mean_loc,'LineWidth',2);
title('定位精度对比','FontSize',13);
ylabel('RMSE/m','FontSize',13);
xlabel('信噪比/dB','FontSize',13);

% axis([0 30 0 0.3 0 300]);